Revit 2026 API

# ExternalFileReference Class

---

A class that contains the details of a reference to a file outside of a given document.

SystemObject Autodesk.Revit.DBExternalFileReference

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalFileReference : IDisposable
```
```vb
Public Class ExternalFileReference
	Implements IDisposable
```
```cpp
public ref class ExternalFileReference : IDisposable
```
```fsharp
type ExternalFileReference =
    class
        interface IDisposable
    end
```

The ExternalFileReference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalFileReferenceType | The type of external file which this object references. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PathType | The path type of the link (relative, absolute, or server). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalFileReference |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAbsolutePath | Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLinkedFileStatus | Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file. |
|  | GetPath | Gets the path of the link, relative or absolute according to the link's settings |
|  | GetReferencingId | Gets the ElementId corresponding to the element which this ExternalFileReference is associated with. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidExternalFileReference | Checks an ExternalFileReference to see if it is properly created. |
|  | IsValidPathTypeForExternalFileReference | Checks whether a PathType enum value will be valid to use with this ExternalFileReference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace